[
  {
    "id": 1,
    "term": "idempotent",
    "term_es": "idempotente",
    "pronunciation": "eye-dem-POH-tent",
    "definition": "An operation that produces the same result no matter how many times it's executed",
    "definition_es": "Una operación que produce el mismo resultado sin importar cuántas veces se ejecute",
    "example": "HTTP PUT is idempotent - sending the same request twice has the same effect as sending it once.",
    "example_es": "HTTP PUT es idempotente - enviar la misma solicitud dos veces tiene el mismo efecto que enviarla una vez.",
    "sentence": "We designed our payment API to be idempotent so duplicate requests won't charge users twice.",
    "sentence_es": "Diseñamos nuestra API de pagos para ser idempotente para que solicitudes duplicadas no cobren dos veces."
  },
  {
    "id": 2,
    "term": "middleware",
    "pronunciation": "MID-uhl-wair",
    "definition": "Software that acts as a bridge between an operating system or database and applications",
    "definition_es": "Software que actúa como puente entre un sistema operativo o base de datos y aplicaciones",
    "example": "Express middleware functions can modify request/response objects before reaching route handlers.",
    "example_es": "Las funciones middleware de Express pueden modificar objetos request/response antes de llegar a los handlers de rutas.",
    "sentence": "The authentication middleware intercepts every request to verify the user's JWT token.",
    "sentence_es": "El middleware de autenticación intercepta cada solicitud para verificar el token JWT del usuario."
  },
  {
    "id": 3,
    "term": "serialization",
    "term_es": "serialización",
    "pronunciation": "seer-ee-uh-lih-ZAY-shun",
    "definition": "Converting an object into a format that can be stored or transmitted and reconstructed later",
    "definition_es": "Convertir un objeto a un formato que puede almacenarse o transmitirse y reconstruirse después",
    "example": "JSON.stringify() serializes JavaScript objects into JSON strings.",
    "example_es": "JSON.stringify() serializa objetos JavaScript a cadenas JSON.",
    "sentence": "We use serialization to convert user data into JSON before sending it over the network.",
    "sentence_es": "Usamos serialización para convertir datos de usuario a JSON antes de enviarlos por la red."
  },
  {
    "id": 4,
    "term": "webhook",
    "pronunciation": "WEB-hook",
    "definition": "An HTTP callback that sends real-time data to other applications when an event occurs",
    "definition_es": "Un callback HTTP que envía datos en tiempo real a otras aplicaciones cuando ocurre un evento",
    "example": "Stripe sends a webhook to your server when a payment succeeds or fails.",
    "example_es": "Stripe envía un webhook a tu servidor cuando un pago tiene éxito o falla.",
    "sentence": "We set up a webhook to notify our Slack channel whenever a new user signs up.",
    "sentence_es": "Configuramos un webhook para notificar nuestro canal de Slack cuando un nuevo usuario se registra."
  },
  {
    "id": 5,
    "term": "latency",
    "term_es": "latencia",
    "pronunciation": "LAY-ten-see",
    "definition": "The delay between a request and its response; time data takes to travel",
    "definition_es": "El retraso entre una solicitud y su respuesta; tiempo que los datos tardan en viajar",
    "example": "A CDN reduces latency by serving content from servers geographically closer to users.",
    "example_es": "Un CDN reduce la latencia sirviendo contenido desde servidores geográficamente más cercanos a los usuarios.",
    "sentence": "Our API latency dropped from 200ms to 50ms after we added Redis caching.",
    "sentence_es": "Nuestra latencia de API bajó de 200ms a 50ms después de agregar caché con Redis."
  },
  {
    "id": 6,
    "term": "throughput",
    "term_es": "rendimiento",
    "pronunciation": "THROO-put",
    "definition": "The amount of data or operations processed in a given time period",
    "definition_es": "La cantidad de datos u operaciones procesadas en un período de tiempo dado",
    "example": "Our server handles 10,000 requests per second at peak throughput.",
    "example_es": "Nuestro servidor maneja 10,000 solicitudes por segundo en rendimiento máximo.",
    "sentence": "We increased throughput by 300% after implementing horizontal scaling.",
    "sentence_es": "Aumentamos el rendimiento un 300% después de implementar escalado horizontal."
  },
  {
    "id": 7,
    "term": "polymorphism",
    "term_es": "polimorfismo",
    "pronunciation": "pol-ee-MOR-fiz-um",
    "definition": "The ability of different objects to respond to the same method call in different ways",
    "definition_es": "La capacidad de diferentes objetos de responder a la misma llamada de método de diferentes formas",
    "example": "Both Cat and Dog classes can have a speak() method that outputs different sounds.",
    "example_es": "Ambas clases Cat y Dog pueden tener un método speak() que produce diferentes sonidos.",
    "sentence": "Polymorphism lets us call render() on any component without knowing its specific type.",
    "sentence_es": "El polimorfismo nos permite llamar render() en cualquier componente sin conocer su tipo específico."
  },
  {
    "id": 8,
    "term": "abstraction",
    "term_es": "abstracción",
    "pronunciation": "ab-STRAK-shun",
    "definition": "Hiding complex implementation details behind a simpler interface",
    "definition_es": "Ocultar detalles complejos de implementación detrás de una interfaz más simple",
    "example": "React's useState hook abstracts away the complexity of state management.",
    "example_es": "El hook useState de React abstrae la complejidad del manejo de estado.",
    "sentence": "Good abstraction lets developers use the API without understanding its internals.",
    "sentence_es": "Buena abstracción permite a desarrolladores usar la API sin entender sus internos."
  },
  {
    "id": 9,
    "term": "encapsulation",
    "term_es": "encapsulación",
    "pronunciation": "en-kap-suh-LAY-shun",
    "definition": "Bundling data and methods that operate on that data within a single unit, restricting direct access",
    "definition_es": "Agrupar datos y métodos que operan sobre esos datos en una sola unidad, restringiendo acceso directo",
    "example": "Private class fields (#) in JavaScript enforce encapsulation.",
    "example_es": "Los campos privados de clase (#) en JavaScript fuerzan la encapsulación.",
    "sentence": "Encapsulation prevents external code from directly modifying the object's internal state.",
    "sentence_es": "La encapsulación previene que código externo modifique directamente el estado interno del objeto."
  },
  {
    "id": 10,
    "term": "immutable",
    "term_es": "inmutable",
    "pronunciation": "ih-MYOO-tuh-bul",
    "definition": "Unable to be changed after creation; modifications create new instances",
    "definition_es": "Incapaz de ser cambiado después de creación; modificaciones crean nuevas instancias",
    "example": "In React, state should be treated as immutable - use setState instead of direct mutation.",
    "example_es": "En React, el estado debe tratarse como inmutable - usa setState en vez de mutación directa.",
    "sentence": "Using immutable data structures eliminates an entire class of bugs caused by unexpected mutations.",
    "sentence_es": "Usar estructuras de datos inmutables elimina toda una clase de bugs causados por mutaciones inesperadas."
  },
  {
    "id": 11,
    "term": "asynchronous",
    "term_es": "asíncrono",
    "pronunciation": "ay-SIN-kruh-nus",
    "definition": "Operations that don't block execution while waiting for completion",
    "definition_es": "Operaciones que no bloquean la ejecución mientras esperan completarse",
    "example": "fetch() is asynchronous - JavaScript continues running while waiting for the response.",
    "example_es": "fetch() es asíncrono - JavaScript continúa ejecutándose mientras espera la respuesta.",
    "sentence": "Asynchronous code allows the UI to remain responsive during network requests.",
    "sentence_es": "El código asíncrono permite que la UI permanezca responsiva durante solicitudes de red."
  },
  {
    "id": 12,
    "term": "deprecated",
    "term_es": "deprecado",
    "pronunciation": "DEP-ruh-kay-tid",
    "definition": "Marked as outdated and scheduled for removal in future versions",
    "definition_es": "Marcado como obsoleto y programado para eliminación en versiones futuras",
    "example": "componentWillMount is deprecated in React - use useEffect instead.",
    "example_es": "componentWillMount está deprecado en React - usa useEffect en su lugar.",
    "sentence": "The API endpoint was deprecated last year and will be removed in v3.0.",
    "sentence_es": "El endpoint de API fue deprecado el año pasado y será eliminado en v3.0."
  },
  {
    "id": 13,
    "term": "refactoring",
    "term_es": "refactorización",
    "pronunciation": "ree-FAK-ter-ing",
    "definition": "Restructuring code without changing its external behavior to improve readability or performance",
    "definition_es": "Reestructurar código sin cambiar su comportamiento externo para mejorar legibilidad o rendimiento",
    "example": "Extracting repeated code into a reusable function is a common refactoring pattern.",
    "example_es": "Extraer código repetido a una función reutilizable es un patrón común de refactorización.",
    "sentence": "We spent a sprint refactoring the legacy codebase to use modern React hooks.",
    "sentence_es": "Pasamos un sprint refactorizando el código legacy para usar hooks modernos de React."
  },
  {
    "id": 14,
    "term": "boilerplate",
    "pronunciation": "BOY-ler-playt",
    "definition": "Standard, repetitive code that must be included with little or no modification",
    "definition_es": "Código estándar y repetitivo que debe incluirse con poca o ninguna modificación",
    "example": "Create React App generates boilerplate so you don't have to configure webpack manually.",
    "example_es": "Create React App genera boilerplate para que no tengas que configurar webpack manualmente.",
    "sentence": "The framework requires too much boilerplate - 50 lines just to set up a basic route.",
    "sentence_es": "El framework requiere demasiado boilerplate - 50 líneas solo para configurar una ruta básica."
  },
  {
    "id": 15,
    "term": "memoization",
    "term_es": "memoización",
    "pronunciation": "mem-oh-ih-ZAY-shun",
    "definition": "Caching the results of expensive function calls to avoid redundant computations",
    "definition_es": "Cachear los resultados de llamadas de función costosas para evitar cálculos redundantes",
    "example": "React.memo() prevents re-renders when props haven't changed.",
    "example_es": "React.memo() previene re-renders cuando las props no han cambiado.",
    "sentence": "Memoization reduced our Fibonacci calculator from exponential to linear time complexity.",
    "sentence_es": "La memoización redujo nuestro calculador Fibonacci de complejidad exponencial a lineal."
  },
  {
    "id": 16,
    "term": "singleton",
    "term_es": "singleton",
    "pronunciation": "SING-gul-ton",
    "definition": "A design pattern that restricts a class to a single instance throughout the application",
    "definition_es": "Un patrón de diseño que restringe una clase a una sola instancia en toda la aplicación",
    "example": "Database connection pools are often implemented as singletons.",
    "example_es": "Los pools de conexión a base de datos frecuentemente se implementan como singletons.",
    "sentence": "The logger is a singleton to ensure all modules write to the same output stream.",
    "sentence_es": "El logger es un singleton para asegurar que todos los módulos escriban al mismo flujo de salida."
  },
  {
    "id": 17,
    "term": "verbose",
    "term_es": "verboso",
    "pronunciation": "ver-BOHS",
    "definition": "Using more words or code than necessary; overly detailed",
    "definition_es": "Usando más palabras o código del necesario; excesivamente detallado",
    "example": "Java is often criticized for being verbose compared to Python.",
    "example_es": "Java es frecuentemente criticado por ser verboso comparado con Python.",
    "sentence": "Enable verbose logging to see detailed debug information during development.",
    "sentence_es": "Habilita logging verboso para ver información de depuración detallada durante desarrollo."
  },
  {
    "id": 18,
    "term": "deterministic",
    "term_es": "determinístico",
    "pronunciation": "dee-ter-min-IS-tik",
    "definition": "Always producing the same output given the same input; no randomness",
    "definition_es": "Siempre produciendo la misma salida dada la misma entrada; sin aleatoriedad",
    "example": "Pure functions are deterministic - add(2, 3) always returns 5.",
    "example_es": "Las funciones puras son determinísticas - add(2, 3) siempre retorna 5.",
    "sentence": "Tests should be deterministic so they don't randomly fail in CI/CD pipelines.",
    "sentence_es": "Las pruebas deben ser determinísticas para que no fallen aleatoriamente en pipelines CI/CD."
  },
  {
    "id": 19,
    "term": "obfuscation",
    "term_es": "ofuscación",
    "pronunciation": "ob-fuh-SKAY-shun",
    "definition": "Making code difficult to understand, often to protect intellectual property",
    "definition_es": "Hacer código difícil de entender, frecuentemente para proteger propiedad intelectual",
    "example": "Minified JavaScript is a form of obfuscation - variable names become single letters.",
    "example_es": "JavaScript minificado es una forma de ofuscación - nombres de variables se convierten en letras solas.",
    "sentence": "We use obfuscation on the client bundle to deter reverse engineering.",
    "sentence_es": "Usamos ofuscación en el bundle del cliente para disuadir ingeniería inversa."
  },
  {
    "id": 20,
    "term": "paradigm",
    "term_es": "paradigma",
    "pronunciation": "PAIR-uh-dime",
    "definition": "A fundamental style or approach to programming (e.g., functional, object-oriented)",
    "definition_es": "Un estilo o enfoque fundamental de programación (ej. funcional, orientado a objetos)",
    "example": "React encourages a declarative paradigm over imperative DOM manipulation.",
    "example_es": "React fomenta un paradigma declarativo sobre manipulación imperativa del DOM.",
    "sentence": "Switching from OOP to a functional paradigm changed how I think about state.",
    "sentence_es": "Cambiar de OOP a un paradigma funcional cambió cómo pienso sobre el estado."
  },
  {
    "id": 21,
    "term": "recursion",
    "term_es": "recursión",
    "pronunciation": "ree-KUR-zhun",
    "definition": "A function that calls itself to solve smaller instances of the same problem",
    "definition_es": "Una función que se llama a sí misma para resolver instancias más pequeñas del mismo problema",
    "example": "Calculating factorial: factorial(n) = n * factorial(n-1)",
    "example_es": "Calcular factorial: factorial(n) = n * factorial(n-1)",
    "sentence": "The file tree component uses recursion to render nested folders of any depth.",
    "sentence_es": "El componente de árbol de archivos usa recursión para renderizar carpetas anidadas de cualquier profundidad."
  },
  {
    "id": 22,
    "term": "endpoint",
    "pronunciation": "END-poynt",
    "definition": "A specific URL where an API can be accessed to perform operations",
    "definition_es": "Una URL específica donde se puede acceder a una API para realizar operaciones",
    "example": "POST /api/users is the endpoint for creating new users.",
    "example_es": "POST /api/users es el endpoint para crear nuevos usuarios.",
    "sentence": "We added a new endpoint for bulk importing contacts from CSV files.",
    "sentence_es": "Agregamos un nuevo endpoint para importación masiva de contactos desde archivos CSV."
  },
  {
    "id": 23,
    "term": "payload",
    "term_es": "carga útil",
    "pronunciation": "PAY-lohd",
    "definition": "The actual data being transmitted in a request or message, excluding headers/metadata",
    "definition_es": "Los datos reales transmitidos en una solicitud o mensaje, excluyendo headers/metadatos",
    "example": "The POST request payload contains the user's registration information.",
    "example_es": "El payload de la solicitud POST contiene la información de registro del usuario.",
    "sentence": "Keep the payload small to reduce bandwidth usage on mobile connections.",
    "sentence_es": "Mantén el payload pequeño para reducir uso de ancho de banda en conexiones móviles."
  },
  {
    "id": 24,
    "term": "sanitization",
    "term_es": "sanitización",
    "pronunciation": "san-ih-tih-ZAY-shun",
    "definition": "Cleaning user input to prevent security vulnerabilities like XSS or SQL injection",
    "definition_es": "Limpiar entrada de usuario para prevenir vulnerabilidades de seguridad como XSS o inyección SQL",
    "example": "Always sanitize HTML input before rendering to prevent script injection.",
    "example_es": "Siempre sanitiza entrada HTML antes de renderizar para prevenir inyección de scripts.",
    "sentence": "The sanitization middleware strips dangerous characters from all form submissions.",
    "sentence_es": "El middleware de sanitización elimina caracteres peligrosos de todos los envíos de formularios."
  },
  {
    "id": 25,
    "term": "debouncing",
    "pronunciation": "dee-BOWN-sing",
    "definition": "Delaying function execution until a pause in rapid events (like typing)",
    "definition_es": "Retrasar ejecución de función hasta una pausa en eventos rápidos (como escritura)",
    "example": "Debounce search input so API calls only fire after the user stops typing.",
    "example_es": "Aplica debounce a búsqueda para que llamadas API solo se disparen cuando el usuario deje de escribir.",
    "sentence": "We added debouncing to prevent 20 API calls when a user types a search query.",
    "sentence_es": "Agregamos debouncing para prevenir 20 llamadas API cuando un usuario escribe una búsqueda."
  },
  {
    "id": 26,
    "term": "throttling",
    "pronunciation": "THROT-ling",
    "definition": "Limiting how often a function can execute within a time period",
    "definition_es": "Limitar qué tan frecuentemente una función puede ejecutarse en un período de tiempo",
    "example": "Throttle scroll handlers to fire at most once every 100ms.",
    "example_es": "Aplica throttle a manejadores de scroll para que disparen máximo una vez cada 100ms.",
    "sentence": "API throttling prevents abuse by limiting each user to 100 requests per minute.",
    "sentence_es": "El throttling de API previene abuso limitando cada usuario a 100 solicitudes por minuto."
  },
  {
    "id": 27,
    "term": "hydration",
    "term_es": "hidratación",
    "pronunciation": "hy-DRAY-shun",
    "definition": "Attaching JavaScript event handlers to server-rendered HTML to make it interactive",
    "definition_es": "Adjuntar manejadores de eventos JavaScript a HTML renderizado por servidor para hacerlo interactivo",
    "example": "Next.js hydrates the page after the initial server-side render completes.",
    "example_es": "Next.js hidrata la página después de que el renderizado inicial del servidor se completa.",
    "sentence": "The hydration mismatch error occurs when server and client HTML don't match.",
    "sentence_es": "El error de desajuste de hidratación ocurre cuando el HTML del servidor y cliente no coinciden."
  },
  {
    "id": 28,
    "term": "transpilation",
    "term_es": "transpilación",
    "pronunciation": "trans-pih-LAY-shun",
    "definition": "Converting source code from one language version to another (e.g., ES6 to ES5)",
    "definition_es": "Convertir código fuente de una versión de lenguaje a otra (ej. ES6 a ES5)",
    "example": "Babel transpiles modern JavaScript to run in older browsers.",
    "example_es": "Babel transpila JavaScript moderno para ejecutar en navegadores antiguos.",
    "sentence": "TypeScript requires transpilation to JavaScript before browsers can execute it.",
    "sentence_es": "TypeScript requiere transpilación a JavaScript antes de que los navegadores puedan ejecutarlo."
  },
  {
    "id": 29,
    "term": "semantic",
    "term_es": "semántico",
    "pronunciation": "suh-MAN-tik",
    "definition": "Relating to meaning; code or markup that clearly conveys its purpose",
    "definition_es": "Relativo al significado; código o marcado que claramente transmite su propósito",
    "example": "Using <nav> instead of <div> is more semantic for navigation elements.",
    "example_es": "Usar <nav> en vez de <div> es más semántico para elementos de navegación.",
    "sentence": "Semantic HTML improves accessibility and SEO by conveying meaning to screen readers.",
    "sentence_es": "HTML semántico mejora accesibilidad y SEO transmitiendo significado a lectores de pantalla."
  },
  {
    "id": 30,
    "term": "agnostic",
    "term_es": "agnóstico",
    "pronunciation": "ag-NOS-tik",
    "definition": "Designed to work with any technology, framework, or platform",
    "definition_es": "Diseñado para funcionar con cualquier tecnología, framework o plataforma",
    "example": "This state management library is framework-agnostic - it works with React, Vue, or vanilla JS.",
    "example_es": "Esta librería de manejo de estado es framework-agnóstica - funciona con React, Vue o vanilla JS.",
    "sentence": "We built the design system to be platform-agnostic so it works on web and mobile.",
    "sentence_es": "Construimos el sistema de diseño para ser plataforma-agnóstico para que funcione en web y móvil."
  }
]
